///////////////////////////////////////////////////////////////////////////////////////////////////
//                                     The act_o Library                                         //
//                                                                                               //
//-----------------------------------------------------------------------------------------------//
// Copyright © 2007 - 2008                                                                       //
//     Pavel A. Artemkin (acto.stan@gmail.com)                                                   //
// ----------------------------------------------------------------------------------------------//
// License:                                                                                      //
//     Code covered by the MIT License.                                                          //
//     The authors make no representations about the suitability of this software                //
//     for any purpose. It is provided "as is" without express or implied warranty.              //
//-----------------------------------------------------------------------------------------------//
// File: act_config.h                                                                            //
//     Конфигурационный файл для библиотеки act-o.                                               //
///////////////////////////////////////////////////////////////////////////////////////////////////

#if !defined ( __multiprog__act_config_h__ )
#define __multiprog__act_config_h__

#pragma once


///////////////////////////////////////////////////////////////////////////////
//               НАСТРОЙКА БИБЛИОТЕКИ ПОД ТЕКУЩЙИ КОМПИЛЯТОР                 //
///////////////////////////////////////////////////////////////////////////////

// Используется компилятор Microsoft, либо совместимый
#if defined( _MSC_VER )

    // Директивы экспорта для сборки DLL
#   ifdef MULTI_EXPORT
#       define ACTO_API     __declspec( dllexport )
    #elif MULTI_IMPORT
#       define ACTO_API     __declspec( dllimport )
#   else
#       define ACTO_API
#   endif

#endif


///////////////////////////////////////////////////////////////////////////////
//               НАСТРОЙКА БИБЛИОТЕКИ ПОД ЦЕЛЕВУЮ ПЛАТФОРМУ                  //
///////////////////////////////////////////////////////////////////////////////



///////////////////////////////////////////////////////////////////////////////
//                                                                           //
///////////////////////////////////////////////////////////////////////////////



#endif // __multiprog__act_config_h__
